



//      画匠问题
 
//      给定一个整型数组arr，数组中的每个值都为正数，表示完成一幅画作需要的时间，
//      再给定一个整数num，表示画匠的数量，每个画匠只能画连在一起的画作。
//      所有的画家并行工作，请返回完成所有的画作需要的最少时间。
//      举例1：
//          arr=[3,1,4]，num=2。
//      解释：
//          最好的分配方式为：第一个画匠画3 和1，所需时间为4。第二个画匠画4，所需时间为4。
//          因为并行工作，所以最少时间为4。如果分配方式为第一个画匠画3，所需时间为3。
//          第二个画匠画 1 和4，所需的时间为5。那么最少时间为5，显然没有第一种分配方式好。
//          所以返回4。
//      举例1：
//          arr=[1,1,1,4,3]，num=3。
//      解释：
//          最好的分配方式为第一个画匠画前三个1，所需时间为3。
//          第二个画匠画4，所需时间为4。
//          第三个画匠画3，所需时间为3。返回4。


PainterQuestion